IDEA Open Model
BondedTendon Class
Compatible with IDEA StatiCa 20.1
 Bonded tendon
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Tendon
 IdeaRS.OpenModel.Model.BondedTendon
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class BondedTendon : Tendon
Public Class BondedTendon
	Inherits Tendon
The BondedTendon type exposes the following members.
Constructors
Name | Description
BondedTendon
 Constructor
Top
Properties
Name | Description
Geometry
 Geometry
Id
 Element Id
 (Inherited from OpenElementId.)
Material
 Material
 (Inherited from Tendon.)
NumberOfStrand
 Number of strands
 (Inherited from Tendon.)
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace